app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs`
---
  def index
    @blogs = Blog.all

INSERT INTO `blogs` (`name`, `about`, `created_at`, `updated_at`) VALUES ('liz', 'a', '2015-05-16 01:47:28', '2015-05-16 01:47:28')
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
    def set_blog
      @blog = Blog.find(params[:id])