app/controllers/posts_controller.rb

    def set_blog
      @blog = Blog.find(params[:blog_id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = NULL LIMIT 1